firstCrude2D/we123/h2/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       12835;
    }
    rightWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          20;
        startFace       12855;
    }
    lowerWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       12875;
    }
    atmosphere
    {
        type            patch;
        nFaces          190;
        startFace       12975;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          13000;
        startFace       13165;
    }
)

// ************************************************************************* //
